---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.HideScopeBoxes
source: html/35cd76fc-ba75-7d6d-ca28-16b13f618f31.htm
---
# Autodesk.Revit.DB.PrintParameters.HideScopeBoxes Property

Indicates whether to hide scope boxes when printing.

## Syntax (C#)
```csharp
public bool HideScopeBoxes { get; set; }
```